[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:58:16
             </Nav>
 
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_USER") && (
-                <Nav.Link
-                  href="/courses/list"
-                  data-testid="appnavbar-courses-list"
-                >
-                  All Courses
-                </Nav.Link>
-              )}
+              {true}
               {hasRole(currentUser, "ROLE_USER") && (
                 <Nav.Link

[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:58:16
             </Nav>
 
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_USER") && (
-                <Nav.Link
-                  href="/courses/list"
-                  data-testid="appnavbar-courses-list"
-                >
-                  All Courses
-                </Nav.Link>
-              )}
+              {false}
               {hasRole(currentUser, "ROLE_USER") && (
                 <Nav.Link

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:66:16
                   All Courses
                 </Nav.Link>
               )}
-              {hasRole(currentUser, "ROLE_USER") && (
-                <Nav.Link
-                  href="/personalschedules/list"
-                  data-testid="appnavbar-personalschedules-list"
-                >
-                  All Schedules
-                </Nav.Link>
-              )}
+              {true}
             </Nav>
 
killedBy: AppNavbar tests renders the PersonalSchedules menu correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-personalschedules-list"]

<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:66:16
                   All Courses
                 </Nav.Link>
               )}
-              {hasRole(currentUser, "ROLE_USER") && (
-                <Nav.Link
-                  href="/personalschedules/list"
-                  data-testid="appnavbar-personalschedules-list"
-                >
-                  All Schedules
-                </Nav.Link>
-              )}
+              {false}
             </Nav>
 
killedBy: AppNavbar tests renders the PersonalSchedules menu correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-personalschedules-list"]

<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
    >
