[Killed] BlockStatement
main/pages/Courses/PSCourseCreatePage.js:17:33
     },
   });
 
-  const onSuccess = (course) => {
-    toast(
-      `New course Created - id: ${course[0].id} enrollCd: ${course[0].enrollCd}`,
-    );
-  };
+  const onSuccess = (course) => {};
 
   const mutation = useBackendMutation(
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New course Created - id: 17 enrollCd: 08250"
Received: "useBackend: Error communicating with backend via GET on /api/personalschedules/all: Error: Request failed with status code 404"

Number of calls: 1

[Killed] BlockStatement
main/pages/Courses/PSCourseCreatePage.js:31:36
   );
 
   const { isSuccess } = mutation;
-  const onSubmit = async (data) => {
-    const psId = {
-      psId: localStorage["CourseForm-psId"],
-    };
-
-    const dataFinal = Object.assign(data, psId);
-    mutation.mutate(dataFinal);
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess) {
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Courses/PSCourseCreatePage.js:32:18
 
   const { isSuccess } = mutation;
   const onSubmit = async (data) => {
-    const psId = {
-      psId: localStorage["CourseForm-psId"],
-    };
+    const psId = {};
 
     const dataFinal = Object.assign(data, psId);
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "enrollCd": "08250",
-   "psId": "13",

[Killed] ConditionalExpression
main/pages/Courses/PSCourseCreatePage.js:43:7
   if (isSuccess) {
     return <Navigate to="/courses/list" />;
   }
-  if (mutation.isError) {
+  if (true) {
     const errorMessage =
       mutation.error.response.data?.message || "Unknown Error";
killedBy: CoursesCreatePage tests renders without crashing
statusReason: TypeError: Cannot read properties of null (reading 'response')

[Killed] ConditionalExpression
main/pages/Courses/PSCourseCreatePage.js:45:7
   }
   if (mutation.isError) {
     const errorMessage =
-      mutation.error.response.data?.message || "Unknown Error";
+      false;
 
     if (mutation.error.response.status === 400) {
killedBy: CoursesCreatePage tests displays error message when backend request fails
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Error: Unknown Error
Received:
  Error:

<html>

[Killed] OptionalChaining
main/pages/Courses/PSCourseCreatePage.js:45:7
   }
   if (mutation.isError) {
     const errorMessage =
-      mutation.error.response.data?.message || "Unknown Error";
+      mutation.error.response.data.message || "Unknown Error";
 
     if (mutation.error.response.status === 400) {
killedBy: CoursesCreatePage tests when you input incorrect information, we get an error
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
main/pages/Courses/PSCourseCreatePage.js:47:9
     const errorMessage =
       mutation.error.response.data?.message || "Unknown Error";
 
-    if (mutation.error.response.status === 400) {
+    if (true) {
       return (
         <BasicLayout>
killedBy: CoursesCreatePage tests displays error message when backend request fails
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Error: Unknown Error
Received:
  Error: Schedule Required

<html>

[Killed] ConditionalExpression
main/pages/Courses/PSCourseCreatePage.js:47:9
     const errorMessage =
       mutation.error.response.data?.message || "Unknown Error";
 
-    if (mutation.error.response.status === 400) {
+    if (false) {
       return (
         <BasicLayout>
killedBy: CoursesCreatePage tests displays error message and button for creating schedule when psId is not provided with backend error
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Error: Schedule Required
Received:
  Error: 'psId' for method parameter type Long is not present

<html>

[Killed] StringLiteral
main/pages/Courses/PSCourseCreatePage.js:62:31
                 backgroundColor: "#34859b",
                 color: "white",
                 padding: "10px",
-                borderRadius: "5px",
+                borderRadius: "",
               }}
               onClick={() =>
killedBy: CoursesCreatePage tests displays error message and button for creating schedule when psId is not provided with backend error
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: rgb(52, 133, 155);
  border: 2px outset buttonface;
- borderRadius: 5px;
  color: white;

[Killed] ArrowFunction
main/pages/Courses/PSCourseCreatePage.js:64:24
                 padding: "10px",
                 borderRadius: "5px",
               }}
-              onClick={() =>
-                (window.location.href = "/personalschedules/create")
+              onClick={() => undefined
               }
             >
killedBy: CoursesCreatePage tests displays error message and button for creating schedule when psId is not provided with backend error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/personalschedules/create"
Received: ""

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Courses/PSCourseCreatePage.js:73:12
           </div>
         </BasicLayout>
       );
-    } else {
-      return (
-        <BasicLayout>
-          <div className="pt-2">
-            <h1>Create New Course</h1>
-
-            <CourseForm submitAction={onSubmit} />
-            <p data-testid="PSCourseCreate-Error">Error: {errorMessage}</p>
-          </div>
-        </BasicLayout>
-      );
-    }
+    } else {}
   }
   return (
killedBy: CoursesCreatePage tests when you input incorrect information, we get an error
statusReason: Error: Unable to find an element by: [data-testid="PSCourseCreate-Error"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
