[Killed] BooleanLiteral
main/components/Courses/CourseForm.js:12:18
   initialCourse,
   submitAction,
   buttonLabel = "Create",
-  codeEditable = true,
+  codeEditable = false,
   enrollmentCode,
 }) {
killedBy: CourseForm tests renders correctly
statusReason: Error: expect(element).not.toHaveAttribute("readOnly") // element.hasAttribute("readOnly")

Expected the element not to have attribute:
  readOnly
Received:
  readOnly=""

[Killed] ConditionalExpression
main/components/Courses/CourseForm.js:46:22
   // Stryker restore all
 
   useEffect(() => {
-    if (schedules && schedules.length > 0 && !localSchedule) {
+    if (schedules && true && !localSchedule) {
       setSchedule(schedules[0].id);
       // Stryker disable all : not sure how to test/mock local storage
killedBy: SpecificCoursesCreatePage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'id')
