[Killed] BlockStatement
main/components/Sections/SectionsTable.js:22:25
   return values[0];
 }
 
-function getVal(values) {
-  if (values.length > 1) {
-    return null;
-  }
-  return values[0];
-}
+function getVal(values) {}
 
 export default function SectionsTable({ sections, currentUser }) {
killedBy: Section tests add button navigates to the create page for Ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="add-button-12583"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] EqualityOperator
main/components/Sections/SectionsTable.js:23:7
 }
 
 function getVal(values) {
-  if (values.length > 1) {
+  if (values.length <= 1) {
     return null;
   }
killedBy: Section tests Has the expected cell values when expanded for user
statusReason: Error: expect(element).toBeEmpty()

Received:
  "<button data-testid=\"add-button-12591\">Add</button>"

[Killed] EqualityOperator
main/components/Sections/SectionsTable.js:23:7
 }
 
 function getVal(values) {
-  if (values.length > 1) {
+  if (values.length >= 1) {
     return null;
   }
killedBy: Section tests add button navigates to the create page for Ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="add-button-12583"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:34:37
   // Stryker disable BooleanLiteral
   const navigate = useNavigate();
 
-  const addCallback = (courseId) => {
-    navigate(`/courses/create/${courseId}`);
-  };
+  const addCallback = (courseId) => {};
 
   const columns = [
killedBy: Section tests add button navigates to the create page for Ordinary user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/create/12583"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:35:14
   const navigate = useNavigate();
 
   const addCallback = (courseId) => {
-    navigate(`/courses/create/${courseId}`);
+    navigate(``);
   };
 
killedBy: Section tests add button navigates to the create page for Ordinary user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/create/12583"
Received: ""

Number of calls: 1

<html>

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:146:5
 
   const columnsIfUser = [
     ...columns,
-    {
-      Header: "Add",
-      id: "add",
-      disableGroupBy: true,
-      aggregate: getVal,
-      accessor: (row) => {
-        return (
-          <button
-            onClick={() => addCallback(row.section.enrollCode)}
-            data-testid={`add-button-${row.section.enrollCode}`}
-          >
-            Add
-          </button>
-        );
-      },
-    },
+    {},
   ];
 
killedBy: Section tests renders without crashing for empty table for user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:151:26
       id: "add",
       disableGroupBy: true,
       aggregate: getVal,
-      accessor: (row) => {
-        return (
-          <button
-            onClick={() => addCallback(row.section.enrollCode)}
-            data-testid={`add-button-${row.section.enrollCode}`}
-          >
-            Add
-          </button>
-        );
-      },
+      accessor: (row) => {},
     },
   ];
killedBy: Section tests add button navigates to the create page for Ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="add-button-12583"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:154:22
       accessor: (row) => {
         return (
           <button
-            onClick={() => addCallback(row.section.enrollCode)}
+            onClick={() => undefined}
             data-testid={`add-button-${row.section.enrollCode}`}
           >
killedBy: Section tests add button navigates to the create page for Ordinary user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/create/12583"

Number of calls: 0

<html>
  <head />
