[Killed] ArrowFunction
main/pages/Courses/PSSpecificCoursePage.js:10:31
 
 export default function SpecificCoursesCreatePage() {
   const { enrollmentcode } = useParams();
-  const objectToAxiosParams = (course) => ({
-    url: "/api/courses/post",
-    method: "POST",
-    params: {
-      enrollCd: course.enrollCd,
-      psId: course.psId,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: SpecificCoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Courses/PSSpecificCoursePage.js:13:13
   const objectToAxiosParams = (course) => ({
     url: "/api/courses/post",
     method: "POST",
-    params: {
-      enrollCd: course.enrollCd,
-      psId: course.psId,
-    },
+    params: {},
   });
 
killedBy: SpecificCoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "enrollCd": "08250",
-   "psId": "13",

[Killed] BlockStatement
main/pages/Courses/PSSpecificCoursePage.js:45:25
   if (isSuccess) {
     return <Navigate to="/courses/list" />;
   }
-  if (mutation.isError) {
-    return (
-      <BasicLayout>
-        <div className="pt-2">
-          <h1>Add New Course</h1>
-
-          <CourseForm
-            submitAction={onSubmit}
-            buttonLabel="Add"
-            codeEditable={false}
-            enrollmentCode={enrollmentcode}
-          />
-          <p data-testid="PSCourseCreate-Error">
-            Error: {mutation.error.response.data?.message}
-          </p>
-        </div>
-      </BasicLayout>
-    );
-  }
+  if (mutation.isError) {}
   return (
     <BasicLayout>
killedBy: SpecificCoursesCreatePage tests when you input incorrect information, we get an error
statusReason: Error: Unable to find an element by: [data-testid="PSCourseCreate-Error"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BooleanLiteral
main/pages/Courses/PSSpecificCoursePage.js:54:27
           <CourseForm
             submitAction={onSubmit}
             buttonLabel="Add"
-            codeEditable={false}
+            codeEditable={true}
             enrollmentCode={enrollmentcode}
           />
killedBy: SpecificCoursesCreatePage tests when you input incorrect information, we get an error
statusReason: Error: expect(element).toHaveAttribute("readOnly") // element.hasAttribute("readOnly")

Expected the element to have attribute:
  readOnly
Received:
  null
