[Killed] StringLiteral
main/pages/SectionSearches/SectionSearchesIndexPage.js:15:10
   const [sectionJSON, setSectionJSON] = useState([]);
 
   const objectToAxiosParams = (query) => ({
-    url: "/api/sections/basicsearch",
+    url: "",
     params: {
       qtr: query.quarter,
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/SectionSearches/SectionSearchesIndexPage.js:16:13
 
   const objectToAxiosParams = (query) => ({
     url: "/api/sections/basicsearch",
-    params: {
-      qtr: query.quarter,
-      dept: query.subject,
-      level: query.level,
-    },
+    params: {},
   });
 
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "dept": "ANTH",
-   "level": "G",
