[Killed] BlockStatement
main/pages/Courses/PSSpecificCoursePage.js:45:25
   if (isSuccess) {
     return <Navigate to="/courses/list" />;
   }
-  if (mutation.isError) {
-    return (
-      <BasicLayout>
-        <div className="pt-2">
-          <h1>Add Specific Course</h1>
-
-          <CourseForm
-            submitAction={onSubmit}
-            buttonLabel="Add"
-            codeEditable={false}
-            enrollmentCode={enrollmentcode}
-          />
-          <p data-testid="PSCourseCreate-Error">
-            Error: {mutation.error.response.data?.message}
-          </p>
-        </div>
-      </BasicLayout>
-    );
-  }
+  if (mutation.isError) {}
   return (
     <BasicLayout>
killedBy: SpecificCoursesCreatePage tests when you input incorrect information, we get an error
statusReason: Error: Unable to find an element by: [data-testid="PSCourseCreate-Error"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
