[Killed] ArrayDeclaration
main/components/PersonalSchedules/PersonalScheduleTableEdit.js:29:19
 
   // Stryker restore all
 
-  const columns = [
-    {
-      Header: "ID",
-      accessor: "id",
-    },
-
-    {
-      Header: "Course Id",
-      accessor: "courseId",
-    },
-    {
-      Header: "Course Name",
-      accessor: "title", // accessor is the "key" in the data
-    },
-  ];
+  const columns = [];
 
   const buttonColumns = [
killedBy: PSCourseEditPage tests renders two PSCourses without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="PSCourseEditTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/PersonalSchedules/PersonalScheduleTableEdit.js:30:5
   // Stryker restore all
 
   const columns = [
-    {
-      Header: "ID",
-      accessor: "id",
-    },
+    {},
 
     {
killedBy: PSCourseEditPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/PersonalSchedules/PersonalScheduleTableEdit.js:35:5
       accessor: "id",
     },
 
-    {
-      Header: "Course Id",
-      accessor: "courseId",
-    },
+    {},
     {
       Header: "Course Name",
killedBy: PSCourseEditPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleTableEdit.js:36:15
     },
 
     {
-      Header: "Course Id",
+      Header: "",
       accessor: "courseId",
     },
killedBy: UserTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Course Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/PersonalSchedules/PersonalScheduleTableEdit.js:39:5
       Header: "Course Id",
       accessor: "courseId",
     },
-    {
-      Header: "Course Name",
-      accessor: "title", // accessor is the "key" in the data
-    },
+    {},
   ];
 
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrayDeclaration
main/components/PersonalSchedules/PersonalScheduleTableEdit.js:45:25
     },
   ];
 
-  const buttonColumns = [
-    ...columns,
-    // Stryker disable next-line all
-    ButtonColumn("Delete", "danger", deleteCallback, "PSCourseEditTable"),
-  ];
+  const buttonColumns = [];
 
   const columnsToDisplay = buttonColumns;
killedBy: PSCourseEditPage tests renders two PSCourses without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="PSCourseEditTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
