[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:15:5
   var { data: personalSchedules } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/personalSections/all?psId=" + id],
-    { method: "GET", url: "/api/personalSections/all?psId=" + id },
+    {},
     [],
   );
killedBy: PSCourseEditPage tests renders two PSCourses without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="PSCourseEditTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:25:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/courses/user/psid/all?psId=" + id],
-    { method: "GET", url: "/api/courses/user/psid/all?psId=" + id },
+    {},
     [],
   );
killedBy: PSCourseEditPage tests renders two PSCourses without crashing for regular user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  72
Received:

[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:29:72
     [],
   );
 
-  const updatedPersonalSchedules = personalSchedules.map((schedule) => {
-    const matchingSchedule = scheduleData.find(
-      (data) => data.enrollCd === schedule.classSections[0].enrollCode,
-    );
-    if (matchingSchedule) {
-      return {
-        ...schedule,
-        id: matchingSchedule.id,
-      };
-    }
-    return schedule;
-  });
+  const updatedPersonalSchedules = personalSchedules.map((schedule) => {});
 
   personalSchedules = updatedPersonalSchedules;
killedBy: PSCourseEditPage tests renders two PSCourses without crashing for regular user
statusReason: Error: Invalid data value

[Killed] EqualityOperator
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:31:17
 
   const updatedPersonalSchedules = personalSchedules.map((schedule) => {
     const matchingSchedule = scheduleData.find(
-      (data) => data.enrollCd === schedule.classSections[0].enrollCode,
+      (data) => data.enrollCd !== schedule.classSections[0].enrollCode,
     );
     if (matchingSchedule) {
killedBy: PSCourseEditPage tests renders two PSCourses without crashing for regular user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  72
Received:
  75

[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:31:7
 
   const updatedPersonalSchedules = personalSchedules.map((schedule) => {
     const matchingSchedule = scheduleData.find(
-      (data) => data.enrollCd === schedule.classSections[0].enrollCode,
+      () => undefined,
     );
     if (matchingSchedule) {
killedBy: PSCourseEditPage tests renders two PSCourses without crashing for regular user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  72
Received:

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:33:9
     const matchingSchedule = scheduleData.find(
       (data) => data.enrollCd === schedule.classSections[0].enrollCode,
     );
-    if (matchingSchedule) {
+    if (true) {
       return {
         ...schedule,
killedBy: PSCourseEditPage tests renders empty table when backend unavailable, user only for psid call
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:33:27
     const matchingSchedule = scheduleData.find(
       (data) => data.enrollCd === schedule.classSections[0].enrollCode,
     );
-    if (matchingSchedule) {
-      return {
-        ...schedule,
-        id: matchingSchedule.id,
-      };
-    }
+    if (matchingSchedule) {}
     return schedule;
   });
killedBy: PSCourseEditPage tests renders two PSCourses without crashing for regular user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  72
Received:

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:34:14
       (data) => data.enrollCd === schedule.classSections[0].enrollCode,
     );
     if (matchingSchedule) {
-      return {
-        ...schedule,
-        id: matchingSchedule.id,
-      };
+      return {};
     }
     return schedule;
killedBy: PSCourseEditPage tests renders two PSCourses without crashing for regular user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  72
Received:
