[Killed] ConditionalExpression
main/components/Jobs/UpdateCoursesByQuarterRangeJobForm.js:13:20
   const { data: systemInfo } = useSystemInfo();
 
   // Stryker disable OptionalChaining
-  const startQtr = systemInfo?.startQtrYYYYQ || "20211";
+  const startQtr = true;
   const endQtr = systemInfo?.endQtrYYYYQ || "20214";
   // Stryker enable OptionalChaining
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: param should be a string

[Killed] ConditionalExpression
main/components/Jobs/UpdateCoursesByQuarterRangeJobForm.js:13:20
   const { data: systemInfo } = useSystemInfo();
 
   // Stryker disable OptionalChaining
-  const startQtr = systemInfo?.startQtrYYYYQ || "20211";
+  const startQtr = false;
   const endQtr = systemInfo?.endQtrYYYYQ || "20214";
   // Stryker enable OptionalChaining
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: param should be a string

[Killed] ConditionalExpression
main/components/Jobs/UpdateCoursesByQuarterRangeJobForm.js:14:18
 
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20211";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20214";
+  const endQtr = false;
   // Stryker enable OptionalChaining
 
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: param should be a string

[Killed] ConditionalExpression
main/components/Jobs/UpdateCoursesByQuarterRangeJobForm.js:14:18
 
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20211";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20214";
+  const endQtr = true;
   // Stryker enable OptionalChaining
 
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: param should be a string

[Killed] BlockStatement
main/components/Jobs/UpdateCoursesByQuarterRangeJobForm.js:31:35
   );
   // Stryker restore all
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    callback({ start_quarter, end_quarter });
-  };
+  const handleSubmit = (event) => {};
 
   // Stryker disable all : Stryker is testing by changing the padding to 0. But this is simply a visual optimization as it makes it look better
killedBy: AdminJobsPage tests user can submit the update course data by the quarter range job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Jobs/UpdateCoursesByQuarterRangeJobForm.js:58:26
               quarters={quarters}
               quarter={end_quarter}
               setQuarter={setEndQuarter}
-              controlId={"BasicSearch.EndQuarter"}
+              controlId={""}
               label="End Quarter"
             />
killedBy: UpdateCoursesByQuarterRangeJobForm tests renders without crashing when fallback values are used
statusReason: Error: Unable to find an element by: [data-testid="/BasicSearch.EndQuarter-option-0/"]

<body>
  <div>
    <form
      class=""
    >
      <div
