[Killed] ArrowFunction
src/main/components/SectionsOverTimeTableBase.js:26:27
   return (
     <Table {...getTableProps()} striped bordered hover>
       <thead>
-        {headerGroups.map((headerGroup) => (
-          <tr {...headerGroup.getHeaderGroupProps()}>
-            {headerGroup.headers.map((column) => (
-              <th
-                {...column.getHeaderProps()}
-                data-testid={`${testid}-header-${column.id}`}
-              >
-                {column.render("Header")}
-              </th>
-            ))}
-          </tr>
-        ))}
+        {headerGroups.map(() => undefined)}
       </thead>
       <tbody {...getTableBodyProps()}>
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Quarter. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
src/main/components/SectionsOverTimeTableBase.js:28:38
       <thead>
         {headerGroups.map((headerGroup) => (
           <tr {...headerGroup.getHeaderGroupProps()}>
-            {headerGroup.headers.map((column) => (
-              <th
-                {...column.getHeaderProps()}
-                data-testid={`${testid}-header-${column.id}`}
-              >
-                {column.render("Header")}
-              </th>
-            ))}
+            {headerGroup.headers.map(() => undefined)}
           </tr>
         ))}
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Quarter. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ConditionalExpression
src/main/components/SectionsOverTimeTableBase.js:44:16
           prepareRow(row);
           return (
             <>
-              {row.cells[0].isGrouped ||
-              (!row.cells[0].isGrouped && row.allCells[3].value) ? (
+              {true ? (
                 <tr {...row.getRowProps()}>
                   {row.cells.map((cell, _index) => {
killedBy: Section tests First dropdown is different than last dropdown
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SectionsOverTimeTable-cell-row-1-col-enrolled"]

Here are the matching elements:

<td
  data-testid="SectionsOverTimeTable-cell-row-1-col-enrolled"
  role="cell"
  style="background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"

[Killed] LogicalOperator
src/main/components/SectionsOverTimeTableBase.js:44:16
           prepareRow(row);
           return (
             <>
-              {row.cells[0].isGrouped ||
-              (!row.cells[0].isGrouped && row.allCells[3].value) ? (
+              {row.cells[0].isGrouped && !row.cells[0].isGrouped && row.allCells[3].value ? (
                 <tr {...row.getRowProps()}>
                   {row.cells.map((cell, _index) => {
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsOverTimeTable-cell-row-0-col-quarter"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BooleanLiteral
src/main/components/SectionsOverTimeTableBase.js:45:16
           return (
             <>
               {row.cells[0].isGrouped ||
-              (!row.cells[0].isGrouped && row.allCells[3].value) ? (
+              (row.cells[0].isGrouped && row.allCells[3].value) ? (
                 <tr {...row.getRowProps()}>
                   {row.cells.map((cell, _index) => {
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsOverTimeTable-cell-row-5-col-location"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ConditionalExpression
src/main/components/SectionsOverTimeTableBase.js:45:16
           return (
             <>
               {row.cells[0].isGrouped ||
-              (!row.cells[0].isGrouped && row.allCells[3].value) ? (
+              (false) ? (
                 <tr {...row.getRowProps()}>
                   {row.cells.map((cell, _index) => {
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsOverTimeTable-cell-row-5-col-location"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
