[Killed] ObjectLiteral
src/main/components/SectionsTableBase.js:14:7
   // Stryker disable next-line ObjectLiteral
   const { getTableProps, getTableBodyProps, headerGroups, rows, prepareRow } =
     useTable(
-      {
-        initialState: {
-          groupBy: ["courseInfo.courseId"],
-          hiddenColumns: ["isSection"],
-        },
-        columns,
-        data,
-      },
+      {},
       useGroupBy,
       useExpanded,
killedBy: Section tests renders without crashing for empty table
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/main/components/SectionsTableBase.js:29:27
   return (
     <Table {...getTableProps()} striped bordered hover>
       <thead key="thead">
-        {headerGroups.map((headerGroup) => (
-          <tr {...headerGroup.getHeaderGroupProps()}>
-            {headerGroup.headers.map((column) => (
-              <th
-                {...column.getHeaderProps()}
-                data-testid={`${testid}-header-${column.id}`}
-              >
-                {column.render("Header")}
-              </th>
-            ))}
-          </tr>
-        ))}
+        {headerGroups.map(() => undefined)}
       </thead>
       <tbody {...getTableBodyProps()} key="tbody">
killedBy: Section tests renders without crashing for empty table for user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Add. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ConditionalExpression
src/main/components/SectionsTableBase.js:47:16
           prepareRow(row);
           return (
             <Fragment key={`row-${i}`}>
-              {row.cells[0].isGrouped ||
-              (!row.cells[0].isGrouped && row.allCells[3].value) ? (
+              {false ? (
                 <tr {...row.getRowProps()}>
                   {row.cells.map((cell, _index) => {
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
src/main/components/SectionsTableBase.js:47:16
           prepareRow(row);
           return (
             <Fragment key={`row-${i}`}>
-              {row.cells[0].isGrouped ||
-              (!row.cells[0].isGrouped && row.allCells[3].value) ? (
+              {true ? (
                 <tr {...row.getRowProps()}>
                   {row.cells.map((cell, _index) => {
killedBy: Section tests Has the expected cell values when expanded for user
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SectionsTable-cell-row-1-col-add"]

Here are the matching elements:

<td
  data-testid="SectionsTable-cell-row-1-col-add"
  role="cell"
  style="background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"

[Killed] LogicalOperator
src/main/components/SectionsTableBase.js:48:16
           return (
             <Fragment key={`row-${i}`}>
               {row.cells[0].isGrouped ||
-              (!row.cells[0].isGrouped && row.allCells[3].value) ? (
+              (!row.cells[0].isGrouped || row.allCells[3].value) ? (
                 <tr {...row.getRowProps()}>
                   {row.cells.map((cell, _index) => {
killedBy: Section tests Has the expected cell values when expanded for user
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SectionsTable-cell-row-1-col-add"]

Here are the matching elements:

<td
  data-testid="SectionsTable-cell-row-1-col-add"
  role="cell"
  style="background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"

[Killed] EqualityOperator
src/main/components/SectionsTableBase.js:80:32
                               {...row.getToggleRowExpandedProps()}
                               data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-expand-symbols`}
                             >
-                              {row.subRows.length > 1
+                              {row.subRows.length <= 1
                                 ? row.isExpanded
                                   ? "➖ "
killedBy: Section tests Correctly groups separate lectures of the same class
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ➕ MATH 3B
Received:
  MATH 3B

[Killed] ConditionalExpression
src/main/components/SectionsTableBase.js:80:32
                               {...row.getToggleRowExpandedProps()}
                               data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-expand-symbols`}
                             >
-                              {row.subRows.length > 1
+                              {true
                                 ? row.isExpanded
                                   ? "➖ "
killedBy: SectionsTableBase tests renders a single lecture section correctly
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span data-testid="testid-cell-row-0-col-courseInfo.courseId-expand-symbols" style="cursor: pointer;" title="Toggle Row Expanded">➕ </span> instead
