[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:19:38
 
   // test job
 
-  const objectToAxiosParamsTestJob = (data) => ({
-    url: `/api/jobs/launch/testjob?fail=${data.fail}&sleepMs=${data.sleepMs}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsTestJob = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:20:10
   // test job
 
   const objectToAxiosParamsTestJob = (data) => ({
-    url: `/api/jobs/launch/testjob?fail=${data.fail}&sleepMs=${data.sleepMs}`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/jobs/launch/testjob?fail=false&sleepMs=0"
Received: ""

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:21:13
 
   const objectToAxiosParamsTestJob = (data) => ({
     url: `/api/jobs/launch/testjob?fail=${data.fail}&sleepMs=${data.sleepMs}`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:30:41
   ]);
   // Stryker restore all
 
-  const submitTestJob = async (data) => {
-    testJobMutation.mutate(data);
-  };
+  const submitTestJob = async (data) => {};
 
   // ***** update courses job *******
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:36:47
 
   // ***** update courses job *******
 
-  const objectToAxiosParamsUpdateCoursesJob = (data) => ({
-    url: `/api/jobs/launch/updateCourses?quarterYYYYQ=${data.quarter}&subjectArea=${data.subject}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesJob = () => undefined;
 
   const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:38:13
 
   const objectToAxiosParamsUpdateCoursesJob = (data) => ({
     url: `/api/jobs/launch/updateCourses?quarterYYYYQ=${data.quarter}&subjectArea=${data.subject}`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:41:56
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({
-    url: `/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=${data.quarter}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesByQuarterJob = () => undefined;
 
   const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:41:67
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({
-    url: `/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=${data.quarter}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({});
 
   const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:42:10
   });
 
   const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({
-    url: `/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=${data.quarter}`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=20211"
Received: ""

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:46:61
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({
-    url: `/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=${data.start_quarter}&end_quarterYYYYQ=${data.end_quarter}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit the update course data by the quarter range job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:69:50
   );
   // Stryker restore all
 
-  const submitUpdateCoursesJob = async (data) => {
-    updateCoursesJobMutation.mutate(data);
-  };
+  const submitUpdateCoursesJob = async (data) => {};
 
   const submitUpdateCoursesByQuarterJob = async (data) => {
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:73:59
     updateCoursesJobMutation.mutate(data);
   };
 
-  const submitUpdateCoursesByQuarterJob = async (data) => {
-    updateCoursesByQuarterJobMutation.mutate(data);
-  };
+  const submitUpdateCoursesByQuarterJob = async (data) => {};
 
   const submitUpdateCoursesByQuarterRangeJob = async (data) => {
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:77:64
     updateCoursesByQuarterJobMutation.mutate(data);
   };
 
-  const submitUpdateCoursesByQuarterRangeJob = async (data) => {
-    updateCoursesByQuarterRangeJobMutation.mutate(data);
-  };
+  const submitUpdateCoursesByQuarterRangeJob = async (data) => {};
   // Stryker disable all
   const {
killedBy: AdminJobsPage tests user can submit the update course data by the quarter range job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:97:5
   // Stryker restore  all
 
   const jobLaunchers = [
-    {
-      name: "Test Job",
-      form: <TestJobForm submitAction={submitTestJob} />,
-    },
+    {},
     {
       name: "Update Courses Database",
killedBy: AdminJobsPage tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element with the text: Test Job. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:102:13
       form: <TestJobForm submitAction={submitTestJob} />,
     },
     {
-      name: "Update Courses Database",
+      name: "",
       form: <UpdateCoursesJobForm callback={submitUpdateCoursesJob} />,
     },
killedBy: AdminJobsPage tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update Courses Database. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:105:5
       name: "Update Courses Database",
       form: <UpdateCoursesJobForm callback={submitUpdateCoursesJob} />,
     },
-    {
-      name: "Update Courses Database by quarter",
-      form: (
-        <UpdateCoursesByQuarterJobForm
-          callback={submitUpdateCoursesByQuarterJob}
-        />
-      ),
-    },
+    {},
     {
       name: "Update Courses Database by the Quarter Range",
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: Unable to find an element with the text: Update Courses Database by quarter. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:113:5
         />
       ),
     },
-    {
-      name: "Update Courses Database by the Quarter Range",
-      form: (
-        <UpdateCoursesByQuarterRangeJobForm
-          callback={submitUpdateCoursesByQuarterRangeJob}
-        />
-      ),
-    },
+    {},
     {
       name: "Update Grade Info",
killedBy: AdminJobsPage tests user can submit the update course data by the quarter range job
statusReason: Error: Unable to find an element with the text: Update Courses Database by the Quarter Range. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:131:27
     <BasicLayout>
       <h2 className="p-3">Launch Jobs</h2>
       <Accordion>
-        {jobLaunchers.map((jobLauncher, index) => (
-          <Accordion.Item eventKey={index} key={index}>
-            <Accordion.Header>{jobLauncher.name}</Accordion.Header>
-            <Accordion.Body>{jobLauncher.form}</Accordion.Body>
-          </Accordion.Item>
-        ))}
+        {jobLaunchers.map(() => undefined)}
       </Accordion>
 
killedBy: AdminJobsPage tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element with the text: Test Job. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
