[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesIndexPage.js:22:29
     [],
   );
 
-  const addSchedule = () => {
-    return(
-      <Button
-        href="/personalschedules/create"
-        data-testid="createButton"
-      >
-      Add Schedule
-      </Button>
-    )
-  }
+  const addSchedule = () => {}
 
   const addCourse = () => {
killedBy: PersonalSchedulesIndexPage tests what happens when you click Add Schedule
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="createButton"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesIndexPage.js:33:27
     )
   }
 
-  const addCourse = () => {
-    return(
-      <Button
-        href="/courses/create"
-        data-testid="appnavbar-courses-create"
-      >
-      Add Course
-      </Button>
-    )
-  }
+  const addCourse = () => {}
   const viewCourses = () => {
     return(

[Survived] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesIndexPage.js:43:29
       </Button>
     )
   }
-  const viewCourses = () => {
-    return(
-      <Button
-        href="/courses/list"
-        data-testid="appnavbar-courses-list"
-      >
-      All Courses
-      </Button>
-    )
-  }
+  const viewCourses = () => {}
 
   return (
