[Killed] ArrowFunction
main/components/Courses/CourseTable.js:49:13
     {
       Header: "Quarter",
       accessor: "course.quarter",
-      Cell: ({ value }) => yyyyqToQyy(value),
+      Cell: () => undefined,
     },
   ];
killedBy: CoursesIndexPage tests renders two courses without crashing for regular user
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrayDeclaration
main/components/Courses/CourseTable.js:52:25
       Cell: ({ value }) => yyyyqToQyy(value),
     },
   ];
-  const columnsIfUser = [
-    ...columns,
-    // ButtonColumn("Edit", "primary", editCallback, "PersonalSchedulesTable"),
-    ButtonColumn("Delete", "danger", deleteCallback, "CourseTable"),
-  ];
+  const columnsIfUser = [];
 
   const columnsToDisplay = hasRole(currentUser, "ROLE_USER")
killedBy: CoursesIndexPage tests renders two courses without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-personalSchedule.id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Courses/CourseTable.js:58:49
     ButtonColumn("Delete", "danger", deleteCallback, "CourseTable"),
   ];
 
-  const columnsToDisplay = hasRole(currentUser, "ROLE_USER")
+  const columnsToDisplay = hasRole(currentUser, "")
     ? columnsIfUser
     : columns;
killedBy: CoursesIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
