[Killed] ObjectLiteral
main/components/Courses/CourseTable.js:26:5
   };
 
   const columns = [
-    {
-      Header: "Personal Schedule ID",
-      accessor: "personalSchedule.id",
-    },
+    {},
     {
       Header: "Personal Schedule Name",
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CourseTable.js:27:15
 
   const columns = [
     {
-      Header: "Personal Schedule ID",
+      Header: "",
       accessor: "personalSchedule.id",
     },
killedBy: UserTable tests Has the expected column headers and content for Ordinary User
statusReason: TestingLibraryElementError: Unable to find an element with the text: Personal Schedule ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Courses/CourseTable.js:28:17
   const columns = [
     {
       Header: "Personal Schedule ID",
-      accessor: "personalSchedule.id",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for Ordinary User
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-personalSchedule.id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Courses/CourseTable.js:35:15
       accessor: "personalSchedule.name",
     },
     {
-      Header: "Enrollment Code",
+      Header: "",
       accessor: "course.classSections[0].enrollCode",
     },
killedBy: UserTable tests Has the expected column headers and content for Ordinary User
statusReason: TestingLibraryElementError: Unable to find an element with the text: Enrollment Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Courses/CourseTable.js:42:5
       Header: "Course ID",
       accessor: "course.courseId",
     },
-    {
-      Header: "Course Name",
-      accessor: "course.title",
-    },
+    {},
     {
       Header: "Quarter",
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CourseTable.js:44:17
     },
     {
       Header: "Course Name",
-      accessor: "course.title",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for Ordinary User
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-course.title"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Survived] ArrowFunction
main/components/Courses/CourseTable.js:48:17
     },
     {
       Header: "Quarter",
-      accessor: (row) => yyyyqToQyy(row.course.quarter),
+      accessor: () => undefined,
     },
   ];
