[Killed] ObjectLiteral
main/pages/Courses/PSCourseIndexPage.js:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/courseDetails/all"],
-    {
-      // Stryker disable next-line StringLiteral : GET is default, so replacing with "" is an equivalent mutation
-      method: "GET",
-      url: "/api/courseDetails/all",
-    },
+    {},
     [],
   );
killedBy: CoursesIndexPage tests renders two courses without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-personalSchedule.id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
